{"class_name": "Tokenizer", "config": {"num_words": 5000, "filters": "!\"#$%&()*+,-./:;<=>?@[\\]^_`{|}~\t\n", "lower": true, "split": " ", "char_level": false, "oov_token": "<unk>", "document_count": 16182, "word_counts": "{\"a\": 21438, \"woman\": 418, \"in\": 7575, \"red\": 5174, \"shirt\": 4943, \"is\": 15647, \"standing\": 6076, \"front\": 2201, \"of\": 2804, \"building\": 2020, \"dog\": 1913, \"running\": 3758, \"through\": 1865, \"field\": 1143, \"young\": 582, \"girl\": 747, \"on\": 2139, \"bench\": 572, \"with\": 733, \"man\": 4427, \"little\": 384, \"pink\": 354, \"playing\": 1554, \"toy\": 208, \"the\": 2282, \"snow\": 449, \"grass\": 66, \"climbing\": 1332, \"rock\": 931, \"wall\": 609, \"group\": 530, \"people\": 495, \"are\": 535, \"overlooking\": 137, \"lake\": 136, \"water\": 308, \"rocky\": 51, \"shore\": 6, \"jumping\": 454, \"swing\": 174, \"white\": 638, \"and\": 696, \"beach\": 156, \"boy\": 340, \"blue\": 210, \"into\": 208, \"pool\": 215, \"sitting\": 274, \"bag\": 33, \"crowd\": 81, \"riding\": 711, \"bike\": 342, \"dirt\": 306, \"track\": 154, \"bicycle\": 49, \"street\": 70, \"umbrella\": 150, \"snowy\": 42, \"hill\": 53, \"horse\": 105, \"motorcycle\": 26, \"soccer\": 91, \"path\": 241, \"air\": 14, \"skateboard\": 191, \"ramp\": 175, \"tennis\": 204, \"surfing\": 225, \"wave\": 225, \"parade\": 27, \"children\": 35, \"dock\": 37, \"ball\": 80, \"car\": 38, \"uniform\": 225, \"trampoline\": 40, \"road\": 9, \"park\": 56, \"off\": 69, \"race\": 29, \"being\": 28, \"ridden\": 28, \"baseball\": 194, \"ground\": 1, \"woods\": 7, \"pole\": 1, \"guitar\": 10, \"city\": 3, \"dogs\": 2, \"game\": 40, \"tree\": 12, \"background\": 6, \"bikes\": 2, \"grassy\": 13, \"mountain\": 9, \"swimming\": 10, \"his\": 1, \"mouth\": 1, \"cones\": 1, \"large\": 2, \"men\": 17, \"cliff\": 1, \"fence\": 5, \"wooded\": 1, \"area\": 1, \"wetsuit\": 22, \"bed\": 1, \"skiing\": 6, \"down\": 10, \"sidewalk\": 1, \"microphone\": 1, \"bird\": 22, \"flying\": 24, \"over\": 16, \"horses\": 4, \"snowmobile\": 4, \"green\": 2, \"snowboarding\": 4, \"swimsuit\": 1, \"leash\": 3, \"flowers\": 1, \"snowboard\": 1, \"rider\": 1, \"leaves\": 1, \"boat\": 1, \"startseq\": 8091, \"who\": 3043, \"endseq\": 8091, \"what\": 5048, \"person\": 1443, \"happening\": 1726}", "word_docs": "{\"front\": 2201, \"in\": 5348, \"of\": 2416, \"building\": 2020, \"is\": 15647, \"woman\": 408, \"a\": 8091, \"standing\": 6076, \"red\": 4584, \"shirt\": 4670, \"through\": 1865, \"running\": 3758, \"field\": 1143, \"dog\": 1913, \"man\": 4183, \"bench\": 569, \"young\": 582, \"with\": 733, \"on\": 2137, \"girl\": 747, \"playing\": 1554, \"toy\": 208, \"pink\": 354, \"little\": 384, \"snow\": 449, \"the\": 2282, \"grass\": 66, \"wall\": 609, \"climbing\": 1332, \"rock\": 931, \"people\": 495, \"group\": 530, \"are\": 535, \"overlooking\": 137, \"lake\": 136, \"water\": 308, \"shore\": 6, \"rocky\": 51, \"swing\": 174, \"jumping\": 454, \"and\": 328, \"white\": 334, \"beach\": 156, \"boy\": 340, \"into\": 208, \"blue\": 204, \"pool\": 215, \"sitting\": 274, \"bag\": 33, \"crowd\": 81, \"riding\": 711, \"track\": 154, \"dirt\": 306, \"bike\": 342, \"bicycle\": 49, \"street\": 70, \"umbrella\": 150, \"snowy\": 42, \"hill\": 53, \"horse\": 105, \"motorcycle\": 26, \"soccer\": 91, \"path\": 241, \"air\": 14, \"skateboard\": 191, \"ramp\": 175, \"tennis\": 204, \"surfing\": 225, \"wave\": 225, \"parade\": 27, \"children\": 35, \"dock\": 37, \"ball\": 80, \"car\": 38, \"uniform\": 225, \"trampoline\": 40, \"road\": 9, \"park\": 56, \"off\": 69, \"being\": 28, \"race\": 29, \"ridden\": 28, \"baseball\": 194, \"ground\": 1, \"woods\": 7, \"pole\": 1, \"guitar\": 10, \"city\": 3, \"dogs\": 2, \"game\": 40, \"tree\": 12, \"background\": 6, \"bikes\": 2, \"grassy\": 13, \"mountain\": 9, \"swimming\": 10, \"his\": 1, \"mouth\": 1, \"cones\": 1, \"large\": 2, \"men\": 17, \"cliff\": 1, \"fence\": 5, \"area\": 1, \"wooded\": 1, \"wetsuit\": 22, \"bed\": 1, \"skiing\": 6, \"down\": 10, \"sidewalk\": 1, \"microphone\": 1, \"over\": 16, \"bird\": 22, \"flying\": 24, \"horses\": 4, \"snowmobile\": 4, \"green\": 2, \"snowboarding\": 4, \"swimsuit\": 1, \"leash\": 2, \"flowers\": 1, \"snowboard\": 1, \"rider\": 1, \"leaves\": 1, \"boat\": 1, \"endseq\": 8091, \"who\": 3043, \"startseq\": 8091, \"what\": 5048, \"person\": 1443, \"happening\": 1726}", "index_docs": "{\"16\": 2201, \"6\": 5348, \"14\": 2416, \"18\": 2020, \"3\": 15647, \"40\": 408, \"2\": 8091, \"7\": 6076, \"8\": 4584, \"10\": 4670, \"20\": 1865, \"12\": 3758, \"25\": 1143, \"19\": 1913, \"11\": 4183, \"34\": 569, \"33\": 582, \"28\": 733, \"17\": 2137, \"27\": 747, \"22\": 1554, \"54\": 208, \"42\": 354, \"41\": 384, \"39\": 449, \"15\": 2282, \"72\": 66, \"32\": 609, \"24\": 1332, \"26\": 931, \"37\": 495, \"36\": 530, \"35\": 535, \"64\": 137, \"65\": 136, \"45\": 308, \"103\": 6, \"75\": 51, \"60\": 174, \"38\": 454, \"30\": 328, \"31\": 334, \"61\": 156, \"44\": 340, \"55\": 208, \"53\": 204, \"52\": 215, \"47\": 274, \"83\": 33, \"68\": 81, \"29\": 711, \"62\": 154, \"46\": 306, \"43\": 342, \"76\": 49, \"70\": 70, \"63\": 150, \"77\": 42, \"74\": 53, \"66\": 105, \"88\": 26, \"67\": 91, \"48\": 241, \"94\": 14, \"58\": 191, \"59\": 175, \"56\": 204, \"49\": 225, \"50\": 225, \"87\": 27, \"82\": 35, \"81\": 37, \"69\": 80, \"80\": 38, \"51\": 225, \"78\": 40, \"100\": 9, \"73\": 56, \"71\": 69, \"85\": 28, \"84\": 29, \"86\": 28, \"57\": 194, \"116\": 1, \"102\": 7, \"117\": 1, \"97\": 10, \"110\": 3, \"112\": 2, \"79\": 40, \"96\": 12, \"104\": 6, \"113\": 2, \"95\": 13, \"101\": 9, \"98\": 10, \"118\": 1, \"119\": 1, \"120\": 1, \"114\": 2, \"92\": 17, \"121\": 1, \"106\": 5, \"123\": 1, \"122\": 1, \"90\": 22, \"124\": 1, \"105\": 6, \"99\": 10, \"125\": 1, \"126\": 1, \"93\": 16, \"91\": 22, \"89\": 24, \"107\": 4, \"108\": 4, \"115\": 2, \"109\": 4, \"127\": 1, \"111\": 2, \"128\": 1, \"129\": 1, \"130\": 1, \"131\": 1, \"132\": 1, \"5\": 8091, \"13\": 3043, \"4\": 8091, \"9\": 5048, \"23\": 1443, \"21\": 1726}", "index_word": "{\"1\": \"<unk>\", \"2\": \"a\", \"3\": \"is\", \"4\": \"startseq\", \"5\": \"endseq\", \"6\": \"in\", \"7\": \"standing\", \"8\": \"red\", \"9\": \"what\", \"10\": \"shirt\", \"11\": \"man\", \"12\": \"running\", \"13\": \"who\", \"14\": \"of\", \"15\": \"the\", \"16\": \"front\", \"17\": \"on\", \"18\": \"building\", \"19\": \"dog\", \"20\": \"through\", \"21\": \"happening\", \"22\": \"playing\", \"23\": \"person\", \"24\": \"climbing\", \"25\": \"field\", \"26\": \"rock\", \"27\": \"girl\", \"28\": \"with\", \"29\": \"riding\", \"30\": \"and\", \"31\": \"white\", \"32\": \"wall\", \"33\": \"young\", \"34\": \"bench\", \"35\": \"are\", \"36\": \"group\", \"37\": \"people\", \"38\": \"jumping\", \"39\": \"snow\", \"40\": \"woman\", \"41\": \"little\", \"42\": \"pink\", \"43\": \"bike\", \"44\": \"boy\", \"45\": \"water\", \"46\": \"dirt\", \"47\": \"sitting\", \"48\": \"path\", \"49\": \"surfing\", \"50\": \"wave\", \"51\": \"uniform\", \"52\": \"pool\", \"53\": \"blue\", \"54\": \"toy\", \"55\": \"into\", \"56\": \"tennis\", \"57\": \"baseball\", \"58\": \"skateboard\", \"59\": \"ramp\", \"60\": \"swing\", \"61\": \"beach\", \"62\": \"track\", \"63\": \"umbrella\", \"64\": \"overlooking\", \"65\": \"lake\", \"66\": \"horse\", \"67\": \"soccer\", \"68\": \"crowd\", \"69\": \"ball\", \"70\": \"street\", \"71\": \"off\", \"72\": \"grass\", \"73\": \"park\", \"74\": \"hill\", \"75\": \"rocky\", \"76\": \"bicycle\", \"77\": \"snowy\", \"78\": \"trampoline\", \"79\": \"game\", \"80\": \"car\", \"81\": \"dock\", \"82\": \"children\", \"83\": \"bag\", \"84\": \"race\", \"85\": \"being\", \"86\": \"ridden\", \"87\": \"parade\", \"88\": \"motorcycle\", \"89\": \"flying\", \"90\": \"wetsuit\", \"91\": \"bird\", \"92\": \"men\", \"93\": \"over\", \"94\": \"air\", \"95\": \"grassy\", \"96\": \"tree\", \"97\": \"guitar\", \"98\": \"swimming\", \"99\": \"down\", \"100\": \"road\", \"101\": \"mountain\", \"102\": \"woods\", \"103\": \"shore\", \"104\": \"background\", \"105\": \"skiing\", \"106\": \"fence\", \"107\": \"horses\", \"108\": \"snowmobile\", \"109\": \"snowboarding\", \"110\": \"city\", \"111\": \"leash\", \"112\": \"dogs\", \"113\": \"bikes\", \"114\": \"large\", \"115\": \"green\", \"116\": \"ground\", \"117\": \"pole\", \"118\": \"his\", \"119\": \"mouth\", \"120\": \"cones\", \"121\": \"cliff\", \"122\": \"wooded\", \"123\": \"area\", \"124\": \"bed\", \"125\": \"sidewalk\", \"126\": \"microphone\", \"127\": \"swimsuit\", \"128\": \"flowers\", \"129\": \"snowboard\", \"130\": \"rider\", \"131\": \"leaves\", \"132\": \"boat\"}", "word_index": "{\"<unk>\": 1, \"a\": 2, \"is\": 3, \"startseq\": 4, \"endseq\": 5, \"in\": 6, \"standing\": 7, \"red\": 8, \"what\": 9, \"shirt\": 10, \"man\": 11, \"running\": 12, \"who\": 13, \"of\": 14, \"the\": 15, \"front\": 16, \"on\": 17, \"building\": 18, \"dog\": 19, \"through\": 20, \"happening\": 21, \"playing\": 22, \"person\": 23, \"climbing\": 24, \"field\": 25, \"rock\": 26, \"girl\": 27, \"with\": 28, \"riding\": 29, \"and\": 30, \"white\": 31, \"wall\": 32, \"young\": 33, \"bench\": 34, \"are\": 35, \"group\": 36, \"people\": 37, \"jumping\": 38, \"snow\": 39, \"woman\": 40, \"little\": 41, \"pink\": 42, \"bike\": 43, \"boy\": 44, \"water\": 45, \"dirt\": 46, \"sitting\": 47, \"path\": 48, \"surfing\": 49, \"wave\": 50, \"uniform\": 51, \"pool\": 52, \"blue\": 53, \"toy\": 54, \"into\": 55, \"tennis\": 56, \"baseball\": 57, \"skateboard\": 58, \"ramp\": 59, \"swing\": 60, \"beach\": 61, \"track\": 62, \"umbrella\": 63, \"overlooking\": 64, \"lake\": 65, \"horse\": 66, \"soccer\": 67, \"crowd\": 68, \"ball\": 69, \"street\": 70, \"off\": 71, \"grass\": 72, \"park\": 73, \"hill\": 74, \"rocky\": 75, \"bicycle\": 76, \"snowy\": 77, \"trampoline\": 78, \"game\": 79, \"car\": 80, \"dock\": 81, \"children\": 82, \"bag\": 83, \"race\": 84, \"being\": 85, \"ridden\": 86, \"parade\": 87, \"motorcycle\": 88, \"flying\": 89, \"wetsuit\": 90, \"bird\": 91, \"men\": 92, \"over\": 93, \"air\": 94, \"grassy\": 95, \"tree\": 96, \"guitar\": 97, \"swimming\": 98, \"down\": 99, \"road\": 100, \"mountain\": 101, \"woods\": 102, \"shore\": 103, \"background\": 104, \"skiing\": 105, \"fence\": 106, \"horses\": 107, \"snowmobile\": 108, \"snowboarding\": 109, \"city\": 110, \"leash\": 111, \"dogs\": 112, \"bikes\": 113, \"large\": 114, \"green\": 115, \"ground\": 116, \"pole\": 117, \"his\": 118, \"mouth\": 119, \"cones\": 120, \"cliff\": 121, \"wooded\": 122, \"area\": 123, \"bed\": 124, \"sidewalk\": 125, \"microphone\": 126, \"swimsuit\": 127, \"flowers\": 128, \"snowboard\": 129, \"rider\": 130, \"leaves\": 131, \"boat\": 132}"}}